{
  "fetchTimestamp": "2024-01-15T10:30:00.000Z",
  "sourceURL": "https://www.linkedin.com/in/crawfordjoseph/details/recommendations/",
  "recommendations": [
    {
      "quote": "Joseph routinely demonstrated his years of industry experience by bringing knowledge to his work and acting as a font of insight for his team members. He was a frequently sought after sound board when tackling complex projects or bugs and could always be counted on to bring a cool methodical approach under strict timelines or pressure. He made sure his peers were primed for success and routinely went out of his way to help them remove obstacles. His enthusiasm for new technologies is contagious and I would heartily welcome the chance to work with him again. If you're looking for an engineer you can depend on for results and answers then you can find no better.",
      "name": "Burton Sickler",
      "title": "Professional Spaghetti Braider"
    },
    {
      "quote": "I would definitely recommend Joseph for a position if asked. While Joseph was working for under me he had no problems or complaints when it came to learning new tools and technologies. Joseph is a very dedicated developer who was not afraid to take on anything we threw at him.  I found him to be very dependable, and could always reach him if needed even outside of normal work hours when critical issues arose.",
      "name": "Ariel Lothlorien",
      "title": "Innovative Tech Professional & Creative Problem Solver"
    },
    {
      "quote": "Joseph is an extremely versatile developer who can be given any task and he will be passionate to complete it. Besides his obvious professionalism in web development I was impressed by how responsive, organised, reliable and fun he is. He's not afraid of coming back with clarifying questions to ensure he can provide the best quality. Joseph will be a valuable team member to anyone who decides to work with him.",
      "name": "Nicolai Manev",
      "title": "Senior Software Developer"
    },
    {
      "quote": "It was a pleasure working with Joseph. He is highly involved in every detail of his work, a team player. He likes to have a deeper understanding of the projects in which he is involved and analyses everything from different perspectives in order to make sure that he finds the best solutions.",
      "name": "Alexandru Coman",
      "title": "Senior PHP Full Stack Developer"
    },
    {
      "quote": "oseph is excellent PHP programmer and I really enjoyed working with him. He was always up to the task no matter what the task was and really eager to learn new things. I was really impressed with his enthusiasm and willingness to even learn my native language Finnish, which is not the easiest of all languages.",
      "name": "Teemu Harju",
      "title": "Senior Software Architect"
    },
    {
      "quote": "Joe is a really passionate engineer who understands the core technologies and get thing done fast, he is one of my PHP guru that I always have questions to ask. He is a friendly easy to work with.",
      "name": "Youvathana Sok",
      "title": "A Red Hatter"
    },
    {
      "quote": "Joe's openness and friendly demeanor made him a delight to work with, and made communication between the different aspects of the project easy to sort out.",
      "name": "Bret Sheeley",
      "title": "Senior Software Developer"
    },
    {
      "quote": "It was a pleasure working with Joe. He is very willing to solve problems and is devoted to understanding how to solve an issue with the code. It would be great to work with him again.",
      "name": "Emily McDivitt",
      "title": "QA Analyst / Security Analyst"
    },
    {
      "quote": "I worked with Joe for more than a year on Nokia Ovi Store.  He is a knowledgeable and enthusiastic PHP developer, always looking for the best solution. Even under pressure, he was delivering quality and reliable code and was not afraid of learning new technologies. Joe did a great job and I would be happy if I have a chance to work with him in the future.",
      "name": "Vesselen Nedkov",
      "title": "Software Architect"
    },
    {
      "quote": "Joe is an very quick learner and always aspires to learn new technologies. He was absolutely efficient with getting tasks done and was also very fun to work with. His helpful manner to other members of the team is another quality that has made him a big contributor to the team.",
      "name": "Quyen Balter",
      "title": "Founder, CEO"
    },
    {
      "quote": "Joe was a highly energetic developer who was always ready to deal with any task given to him. He was the 'go to guy' for any php related issues. I have never seen him say no when people approached him for any kind of help (even when working on critical issues). I would recommend him with out any reservations.",
      "name": "Praveen Peddi",
      "title": "Amazon Principal Engineer"
    },
    {
      "quote": "Joe is one of the most energetic developers I have worked with.  He quick programmer who has an eye for detail and the bigger picture.  He has a palpable and infectious passion for his work and is consistently looking to learn and improve.  He enjoys collaborating with team members and is always looking to lend a hand and share what he has learned.  I'd work with Joe any time.",
      "name": "Areth Foster-Webster",
      "title": "Senior Software Engineer"
    },
    {
      "quote": "I had a fortune to work with Joe at Nokia Inc. He is a hard worker with a contagious enthusiasm that makes him a joy to work with. Joe is probably the most energetic person I've ever met. He rolls up his sleeves and jumps in to get the job done. He is also constantly eager to learn something new and has a very deep understanding of his areas of expertise. I would welcome an opportunity to work with him again.",
      "name": "Ilya Simon",
      "title": "AI is eating software"
    },
    {
      "quote": "I enjoyed working with Joe. Joe is a very extremely helpful and very talented person. Whenever you need help, he will jump on it and offer his expertise right away. I actually learned a lot from Joe.",
      "name": "Hai Nguyen",
      "title": "Software Engineer Manager"
    },
    {
      "quote": "Joseph is very in tune with translating business requirements into web applications. His work on a strategic new product here at NameSpace exceeded expectations on both robustness of the interface and time to delivery. I would recommend Joseph to any company looking for a developer with both technical expertise and business sense, together with an ability to work with senior level people across functional areas.",
      "name": "Dom LaCava",
      "title": "Strategic Business Development | Technology Partnerships | Content, Commerce & GenAI"
    },
    {
      "quote": "Joseph is a motivated, self starter with a great work ethic. He hungrily attacks new problems and embraces new technologies with a focus on getting the job done. I managed him directly and would welcome him back to my team anytime.",
      "name": "Russ Hammer",
      "title": ""
    },
    {
      "quote": "Joseph was a pleasure to work with. He was always willing to accept whatever task necessary. He is professional and detail orientated.",
      "name": "Daniel Falcone",
      "title": ""
    },
    {
      "quote": "PHP consulting is a relatively new business, and Joseph stands out as someone who brings a professional attitude to an open source concept. His Zend certification backs this up. I have no qualms recommending Joseph as a talented and valuable programmer.",
      "name": "Jaz-Michael King",
      "title": ""
    },
    {
      "quote": "Hiring Joseph to work on web application development at eFashion is one of the things I am most proud of in my work at eFS. Joseph works fast and clean, is quick to come up to speed on new material and is extremely creative as a problem solver in terms of his application development skills. I'd hire him again in a second.",
      "name": "Joshua S. Freeman",
      "title": "Hands-On, Experienced IT Leader"
    },
    {
      "quote": "Joseph is a great addition to the team at eFashion, and it is always a pleasure working with him. He thinks around corners, and always gets the job done. I would highly recommend working with him.",
      "name": "Austin Butler",
      "title": "President & Founder at Teaching.com"
    },
    {
      "quote": "Joe is a great person to work with, always having initiative and a helpful, no-nonsense approach to developing software. He's particularly adept with web-based application development, and has a healthy appetite to learn and experiment with emerging technologies.",
      "name": "Mitch Pirtle",
      "title": "Health AI Innovator | Startup CTO | Technology Strategist | Entrepreneurial Leader | DEI Advocate"
    }
  ]
}

